; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v4)
		(pred_3 ?v7)
		(pred_1 ?v6)
		(pred_6 ?v6)
		(pred_2 ?v7 ?v6)
		(pred_5)
		(pred_4 ?v7))

   (:action op_2
       :parameters  (?v5 ?v2)
       :precondition (and (not-eq ?v5 ?v2) 
                          (pred_1 ?v5) (pred_1 ?v2) (pred_6 ?v5))
       :effect (and  (pred_6 ?v2)
		     (not (pred_6 ?v5))))


   (:action op_3
       :parameters (?v1 ?v8)
       :precondition  (and  (pred_3 ?v1) (pred_1 ?v8)
			    (pred_2 ?v1 ?v8) (pred_6 ?v8) (pred_5))
       :effect (and (pred_4 ?v1)
		    (not (pred_2 ?v1 ?v8)) 
		    (not (pred_5))))

   (:action op_1
       :parameters  (?v1  ?v8)
       :precondition  (and  (pred_3 ?v1) (pred_1 ?v8)
			    (pred_4 ?v1) (pred_6 ?v8))
       :effect (and (pred_2 ?v1 ?v8)
		    (pred_5)
		    (not (pred_4 ?v1)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_09 obj_07 obj_03 obj_01 obj_05 obj_04 
          obj_08 obj_06 obj_02 
)
(:init
(pred_1 obj_09)
(pred_1 obj_07)
(pred_1 obj_03)
(pred_1 obj_01)
(pred_1 obj_05)
(pred_1 obj_04)
(pred_3 obj_08)
(pred_3 obj_06)
(pred_3 obj_02)
(not-eq obj_09 obj_07)
(not-eq obj_07 obj_09)
(not-eq obj_09 obj_03)
(not-eq obj_03 obj_09)
(not-eq obj_09 obj_01)
(not-eq obj_01 obj_09)
(not-eq obj_09 obj_05)
(not-eq obj_05 obj_09)
(not-eq obj_09 obj_04)
(not-eq obj_04 obj_09)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(pred_5)
(pred_2 obj_08 obj_01)
(pred_2 obj_06 obj_01)
(pred_2 obj_02 obj_09)
(pred_6 obj_05)
)
(:goal
(and
(pred_2 obj_08 obj_07)
(pred_2 obj_06 obj_09)
(pred_2 obj_02 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_08 obj_07) (pred_6 obj_09))
    (sometime-before  (pred_2 obj_06 obj_09) (pred_6 obj_07))
    (sometime-before  (pred_2 obj_02 obj_04) (pred_6 obj_07))
  )
)
)

; plan
1. (op_2 obj_05 obj_09)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_09)
   goals met: 0 of 3
2. (op_3 obj_02 obj_09)
   deleted: (pred_2 obj_02 obj_09) (pred_5)
   added: (pred_4 obj_02)
   goals met: 0 of 3
3. (op_2 obj_09 obj_01)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_01)
   goals met: 0 of 3
4. (op_1 obj_02 obj_01)
   deleted: (pred_4 obj_02)
   added: (pred_2 obj_02 obj_01) (pred_5)
   goals met: 0 of 3
5. (op_3 obj_08 obj_01)
   deleted: (pred_2 obj_08 obj_01) (pred_5)
   added: (pred_4 obj_08)
   goals met: 0 of 3
6. (op_2 obj_01 obj_07)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_07)
   goals met: 0 of 3
7. (op_1 obj_08 obj_07)
   deleted: (pred_4 obj_08)
   added: (pred_2 obj_08 obj_07) (pred_5)
   goals met: 1 of 3
8. (op_2 obj_07 obj_01)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_01)
   goals met: 1 of 3
9. (op_3 obj_02 obj_01)
   deleted: (pred_2 obj_02 obj_01) (pred_5)
   added: (pred_4 obj_02)
   goals met: 1 of 3
10. (op_2 obj_01 obj_04)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_04)
   goals met: 1 of 3
11. (op_1 obj_02 obj_04)
   deleted: (pred_4 obj_02)
   added: (pred_2 obj_02 obj_04) (pred_5)
   goals met: 2 of 3
12. (op_2 obj_04 obj_01)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_01)
   goals met: 2 of 3
13. (op_3 obj_06 obj_01)
   deleted: (pred_2 obj_06 obj_01) (pred_5)
   added: (pred_4 obj_06)
   goals met: 2 of 3
14. (op_2 obj_01 obj_09)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_09)
   goals met: 2 of 3
15. (op_1 obj_06 obj_09)
   deleted: (pred_4 obj_06)
   added: (pred_2 obj_06 obj_09) (pred_5)
   goals met: 3 of 3
